-- 作品/产品、服务、设计师、企业
-- 用户：普通用户、设计师、企业
-- 企业用户资质申请：法人姓名、法人身份证号、身份证正面图、身份证反面图、联系电话、社会信用代码、营业执照照片、支付宝
-- 企业资料：企业名称、头像、首页轮播图（三张）、内页背景图、人才理念（文字简短说明）、企业介绍、
--         联系方式（电话、QQ、微信、邮箱、公司地址-省、市、区-详细地址、 地图定位）
-- 企业岗位：岗位名、招降部门、内容、工作地点、招人数。时间

-- 设计师资质申请：真实姓名、身份证号、身份证正面图、身份证反面图、手机、支付宝账号、是否是学生，学生证照片
-- 设计师个人资料： 昵称、头像、性别、简介、家乡、省、市、区、擅长领域、个性签名、毕业院校/专业、QQ、微信号 、个人标签（暂时不做）
-- 设计师数据统计：成交总额、成交单数、人气、公益贡献值、学益购奖章、作品、服务、圈子
-- 我的收藏：
-- 我的圈子：
-- 圈子：标题、封面图、圈子导读、圈子内容、发表时间
-- 设计师订单： 待付款、待发货、待收货、已完成。

-- 产品服务都为商品，不同分类

-- 服务(企业和设计师都可以发布)： 
--       服务名称、封面图、服务类别（文学、理学、工学、艺术学、其他学科）、服务价格、  服务内容
-- 产品：作品产品名、封面图、   类别（）、 价格、   作品格式（）、作品大小、作品颜色模式、作品内容、上架状态、库存、时间


-- 地址： 姓名、电话、省、市、区、详细地址、所属用户、是否为默认
-- 我的财务：我的余额、提现中、

用户类型表  


工作状态：

1.用户注册 （分用户类型（普通用户、设计师、企业）没完成）
2.用户审核 （前端，后台）
3.产品、服务（数据表已设计、功能还未做）
4.产品发布（后台与前端功能还未做）
5.购物车（表已设计、后台与前端功能还未做）
6.我的收藏 （数据表已设计、功能还未做）
7.我的圈子 （数据表还未设计）
8.个人中心（表已设计、后台与前端功能还未做）
9.在线支付（表已设计、后台与前端功能还未做）
10.提现（表已设计、后台与前端功能还未做）
11.企业招人（未做）
12.首页轮播（数据表已设计、后台与前端功能还未做）

开发功能任务    工时    预计完成日期   实际完成日期   开发工程师

